
/*
    Это автосгенерированный файл. Руками не править
*/
//---------------------------------------------------------------------------
#ifndef __tApc_TMyNewCntr_h__
#define __tApc_TMyNewCntr_h__
//---------------------------------------------------------------------------


class TMyNewCntr
{
   
    string name;
    int age = 12;
    
    

   
   string Print(int age, string name = "12");
        
   std::string printState() const;
};
//---------------------------------------------------------------------------
#endif
